#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"] will be updated in-place
  ~ resource "digitalocean_record" "kubernetes_subdomain_dns" {
        domain   = "foreignlanguagereader.com"
        flags    = 0
        fqdn     = "api.foreignlanguagereader.com"
        id       = "94190119"
        name     = "api"
        port     = 0
        priority = 0
        ttl      = 1800
        type     = "A"
      ~ value    = "138.197.236.201" -> (known after apply)
        weight   = 0
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["kibana"] will be updated in-place
  ~ resource "digitalocean_record" "kubernetes_subdomain_dns" {
        domain   = "foreignlanguagereader.com"
        flags    = 0
        fqdn     = "kibana.foreignlanguagereader.com"
        id       = "94190120"
        name     = "kibana"
        port     = 0
        priority = 0
        ttl      = 1800
        type     = "A"
      ~ value    = "138.197.236.201" -> (known after apply)
        weight   = 0
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["language"] will be updated in-place
  ~ resource "digitalocean_record" "kubernetes_subdomain_dns" {
        domain   = "foreignlanguagereader.com"
        flags    = 0
        fqdn     = "language.foreignlanguagereader.com"
        id       = "94190121"
        name     = "language"
        port     = 0
        priority = 0
        ttl      = 1800
        type     = "A"
      ~ value    = "138.197.236.201" -> (known after apply)
        weight   = 0
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
